cask_args appdir: '/Applications'

tap 'caskroom/versions'
tap 'neovim/homebrew-neovim'

brew 'ack'
brew 'coreutils'
brew 'bash-completion'
brew 'cmake'
brew 'docker'
brew 'docker-machine'
brew 'git'
brew 'git-extras'
brew 'go'
brew 'gpg'
brew 'heroku-toolbelt'
brew 'hh'
brew 'htop-osx'
brew 'httpie'
brew 'imagemagick'
brew 'qt'
brew 'mc'
brew 'memcached'
brew 'mongodb'
brew 'mtr'
brew 'mycli'
brew 'mysql'
brew 'neovim', args: ['HEAD']
brew 'nmap'
brew 'nvm'
brew 'p7zip'
brew 'pngquant'
brew 'pstree'
brew 'redis'
brew 'shellcheck'
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'thefuck'
brew 'tmux'
brew 'ttyrec'
brew 'wget'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-completions'

cask 'atom'
cask 'diffmerge'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'google-hangouts'
cask 'handbrake'
cask 'iterm2'
cask 'java'
cask 'libreoffice'
cask 'limechat'
cask 'skype'
cask 'smoothmouse'
cask 'sourcetree'
cask 'sublime-text3'
cask 'the-unarchiver'
cask 'transmission'
cask 'trim-enabler'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'xquartz'

# After X is installed
cask 'wireshark'

# After Java is installed
brew 'android-sdk'
brew 'gradle'
